app/Controllers/CsvController.php

                    return $this->response->setJSON(['status' => 'error', 'validation_errors' => ['Invalid email format in row: ' . implode(', ', $data)]]);
                }

                if ($userModel->where('email', $data[1])->first()) {
---
SELECT *
FROM `user`
WHERE `email` = 'komal@gmail.com'
 LIMIT 1